insert into Исполнители (имя, id)
values
('Борис Гребенщиков',1),
('Hartyga',2),
('НОМ',3),
('Градусы',4),
('Лобода',5),
('10 age',6),
('Peggy Sue',7),
('Инфинити',8),
('Grupo Extra',9),
('Sigrid',10),
('Александр Вестов',11),
('Deep Purple',12);
insert into Альбомы (id, название, год_выпуска)
values
(1, 'Время N', 2019),
(2, 'Amyrsanaa', 2018),
(3, 'Я тебя услышал', 2018),
(4, 'Градус 100', 2020),
(5, 'Начистоту', 2014),
(6, 'Зоопарк', 2021),
(7, 'Vices', 2017),
(8, 'Увлечение', 2016),
(9, 'Sus exitos en bachata', 2019),
(10, 'Sucker Punch', 2019),
(11, 'Слеза упала в кофе', 2015),
(12, 'Burn', 1974);
insert into Треки (id, название, длительность, альбом_id)
values
(1, 'Время N', 202, 1),
(2, 'Ножи Бодхисаттвы', 298, 1),
(3, 'Red star', 331, 2),
(4, 'Silks', 183, 2),
(5, 'Я тебя услышал', 314, 3),
(6, 'Северное сияние', 388, 3),
(7, 'О тебе думаю', 248, 4),
(8, 'Смотришь в небо', 198, 5),
(9, 'Мой', 248, 5),
(10, 'Зоопарк',180, 6),
(11, 'Buddy Holly', 223, 7),
(12, 'Алло', 252, 8),
(13, 'A traves del vaso', 228, 9),
(14, 'Sight of you', 188, 10),
(15, 'Сто тысяч слов', 258, 11),
(16, 'Burn', 263, 12);
insert into Сборники (id, название, год_выпуска )
values
(1, 'Топ 100 2020 года', 2020),
(2, 'Популярная музыка ВК', 2021),
(3, '101 ROCK AND ROLL', 2017),
(4, 'Бомба года от Европы плюс', 2016),
(5, 'Fiesta latina', 2019),
(6, 'Best of the top 2019', 2019),
(7, 'Блатной суперхит', 2015),
(8, 'The complete classic rock collection', 2014);
insert into Жанры (id, название)
values
(1, 'Поп'),
(2, 'Рок'),
(3, 'Рэп'),
(4, 'Джаз'),
(5, 'Шансон');
insert into ИсполнЖанры (id, исполнитель_id, жанр_id)
values
(1,1,2 ),
(2,2,4 ),
(3,3,1 ),
(4,4,1 ),
(5,5,1 ),
(6,6,3 ),
(7,7,2 ),
(8,8,3 ),
(9,9,2 ),
(10,10,4 ),
(11,11,5 ),
(12,12,2 ),
(13,12,4 );
insert into ТрекСборник (id, трек_id, сборник_id)
values
(1,7,1 ),
(2,8,1 ),
(3,9,1 ),
(4,10,2 ),
(5,11,3 ),
(6,12,4 ),
(7,13,5 ),
(8,14,6 ),
(9,15,7 ),
(10,16,8 );
insert into АльбИсполн (id, альбом_id, исполнитель_id)
values
(1,1,1 ),
(2,2,2 ),
(3,3,3 ),
(4,4,4 ),
(5,5,5 ),
(6,6,6 ),
(7,7,7 ),
(8,8,8),
(9,9,9 ),
(10,10,10 ),
(11,11,11 ),
(12,12,12 );

